[
    {
      "text": "Пишите код так, как будто сопровождать его будет склонный к насилию психопат, который знает, где вы живете.",
      "author": "Стив Макконнелл"
    },
    {
      "text": "Сложность программы растет до тех пор, пока не превысит способности программиста.",
      "author": "Артур Блох. Законы Мэрфи"
    },
    {
      "text": "Измерять продуктивность программиста подсчетом строк кода — это так же, как оценивать постройку самолета по его весу.",
      "author": "Билл Гейтс"
    },
    {
     "text": "Большинство хороших программистов делают свою работу не потому, что ожидают оплаты или признания, а потому что получают удовольствие от программирования.",
     "author": "Линус Торвальдс"
    },
    {
     "text": "Если вы дадите человеку программу, то займете его на один день. Если вы научите человека программировать, то займете его на всю жизнь.",
     "author": "Вазим Латиф"
    },
    {
     "text": "Люди, которые думают, что ненавидят компьютеры, на самом деле ненавидят плохих программистов.",
     "author": "Ларри Нивен"
    },
    {
     "text": "Любой дурак сможет написать код, который поймет машина. Хорошие программисты пишут код, который сможет понять человек.",
     "author": "Мартин Фаулер"
    },
    {
     "text": "Простота — залог надежности.",
     "author": "Эдсгер В. Дийкстра"
    },
    {
     "text": "Чтобы понять код мида, нужно быть мидом. Чтобы понять код сеньора, достаточно быть джуном.",
     "author": "Гейб Логан Ньюэлл"
    },
    {
     "text": "Не бывает хороших языков, бывают хорошие программисты.",
     "author": "Андерс Хейлсберг"
    },
    {
     "text": "Чем опытнее программист, тем лучше он осознаёт всю скудность своих знаний и навыков.",
     "author": "Крис Хьюз"
    },
    {
     "text": "Работает? Не трогай.",
     "author": "Любой программист"
    },
    {
     "text": "Лень — естественное состояние программиста, после которого он рождает хороший алгоритм.",
     "author": "Народное творчество"
    }
    
  ] 